testArr = [
    'Агалакова  ул., 66А',
    'Аношкина ул.,10  (паркинг)',
    'Артиллерийский  пер., 6А',
    'Генерала Мартынова ул., 14',
    'Геологов ул., 7А п. Новосинеглазово',
    'Героя России Родионова пр.-т, 12',
    'Героя России Кислова наб., 27',
    'Радистов  пер., 1',
    'Доватора ул., ост. "Колющенко" ',
    'Революции пл., 1/1',
    'Ленина пр., 2М',
    'перечечение ул. Доватора и ул. Степана Разина',
    'пересечение ул. Кирова и пр. Победы',
    'пересечение ул. Дзержинского и ул. Отечественная',
    'пересечение ул. Черкасская и Свердловский пр.',
    'пересечение ул. 3-го Интернационала и пр. Ленина',
    'пересечение ул. Свободы и пр.Ленина ',
    'пересечение Дзержинского и Отечественная',
    ' 26 Бакинских Комиссаров ул., 63',
    '8 Марта ул.,14А п. Новосинеглазово'
  ];

  const addressesArray = testArr;
  const key =
  const app =  

  async function adressDecoder(addressesArray) {

  };